{
  "title": "Paradox Mobile Game",
  "main_image": "img/paradox1.png",
  "long_description": [
    "<p><strong>Paradox</strong> is a 2D temporal puzzle game I developed, inspired by the time-inversion mechanics from the film <em>Tenet</em>.</p>",
    "<p>The core gameplay loop allows the player to <strong>invert</strong> their personal flow of time. This causes them to move backward through the world, observing their own past actions in reverse. By <strong>re-verting</strong> to forward time, the player creates a new \"self\" on the timeline, allowing them to cooperate with their own past selves to solve complex puzzles.</p>",
    "<p>The game also features inverted physics objects. For example, an \"inverted bomb\" doesn't explode; it implodes, sucking in energy and freezing its surroundings, as its entropy is reversed relative to the world.</p>",
    "<h3>Technical Implementation</h3>",
    "<ul>",
    "<li><strong>Engine:</strong> Developed in <strong>Unity (C#)</strong>.</li>",
    "<li><strong>Core Mechanic:</strong> The entire <em>Tenet</em>-style time system is powered by a <strong>complex, custom data structure</strong> I designed from scratch. This structure manages multiple, simultaneous timelines for each \"self\" (past, inverted, and present) and allows for the data to be read both forwards and backwards seamlessly.</li>",
    "<li><strong>Monetization:</strong> I integrated an <strong>ad mediation platform</strong> to manage and optimize ad revenue by having multiple providers bid for ad spots. I also implemented an <strong>In-App Purchase (IAP)</strong> system for an \"Ad-Free\" option.</li>",
    "<li><strong>Platform:</strong> Published and available on both the <strong>iOS App Store</strong> and <strong>Google Play Store</strong>.</li>",
    "</ul>"
  ],
  "technologies": [
    "Unity",
    "C#",
    "Ad Mediation",
    "In App Purchases",
    "Xcode",
    "Google Play Console",
    "Apple Store Connect"
  ],
  "gallery": [
    {
      "image": "img/Paradox/Slide1Paradox.png",
      "caption": "Recording Your Time 'Footprint'",
      "description": "<p>To allow inversion, the game constantly records 'Moments' of <strong>Position</strong>, <strong>Direction</strong>, and <strong>IsMoving</strong> status (15 times a second). This data acts like a 'footprint' in time. I smooth this data so when you watch your past selves, their movement is fluid, not jerky.</p>"
    },
    {
      "image": "img/Paradox/Slide2Paradox.png",
      "caption": "Visualizing Your Path Through Time",
      "description": "<p>This diagram visualizes how you exist on the timeline:</p><ul><li><strong>Top Row (Green):</strong> This is your original path, moving forward in time.</li><li><strong>Middle Row (Red):</strong> You've 'inverted,' moving backward from Moment 4 to Moment 2 and watching your original self's actions in reverse.</li><li><strong>Bottom Row (Green):</strong> You 're-vert' at Moment 2, moving forward again and co-existing with your other selves.</li></ul>"
    },
    {
      "image": "img/Paradox/Slide3Paradox.png",
      "caption": "How All Your 'Selves' Appear at Once",
      "description": "<p>This shows the magic that lets you see multiple 'yous' at once. I use a dictionary to group all 'selves' by the 'Moment' they are in.</p><p>For example, at <strong>'Moment 3'</strong>, the game looks up that key and finds:</p><ul><li>Your original 'past-past self' (top row).</li><li>Your 'inverted self' (middle row).</li><li>Your current self (bottom row).</li></ul><p>It then displays all three on-screen, all moving in their respective directions.</p>"
    }
  ]
}